#ifndef HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_COMPOSER_V2_1_ICOMPOSERCLIENT_H
#define HIDL_GENERATED_ANDROID_HARDWARE_GRAPHICS_COMPOSER_V2_1_ICOMPOSERCLIENT_H

#include <android/hardware/graphics/common/1.0/types.h>
#include <android/hardware/graphics/composer/2.1/IComposerCallback.h>
#include <android/hardware/graphics/composer/2.1/types.h>
#include <android/hidl/base/1.0/IBase.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace graphics {
namespace composer {
namespace V2_1 {

struct IComposerClient : public ::android::hidl::base::V1_0::IBase {
    enum class Attribute : int32_t {
        INVALID = 0,
        WIDTH = 1,
        HEIGHT = 2,
        VSYNC_PERIOD = 3,
        DPI_X = 4,
        DPI_Y = 5,
    };

    enum class DisplayRequest : uint32_t {
        FLIP_CLIENT_TARGET = 1u, // (1 << 0)
        WRITE_CLIENT_TARGET_TO_OUTPUT = 2u, // (1 << 1)
    };

    enum class LayerRequest : uint32_t {
        CLEAR_CLIENT_TARGET = 1u, // (1 << 0)
    };

    enum class PowerMode : int32_t {
        OFF = 0,
        DOZE = 1,
        DOZE_SUSPEND = 3,
        ON = 2,
    };

    enum class Vsync : int32_t {
        INVALID = 0,
        ENABLE = 1,
        DISABLE = 2,
    };

    enum class BlendMode : int32_t {
        INVALID = 0,
        NONE = 1,
        PREMULTIPLIED = 2,
        COVERAGE = 3,
    };

    enum class Composition : int32_t {
        INVALID = 0,
        CLIENT = 1,
        DEVICE = 2,
        SOLID_COLOR = 3,
        CURSOR = 4,
        SIDEBAND = 5,
    };

    enum class DisplayType : int32_t {
        INVALID = 0,
        PHYSICAL = 1,
        VIRTUAL = 2,
    };

    enum class HandleIndex : int32_t {
        EMPTY = -1, // (-1)
        CACHED = -2, // (-2)
    };

    struct Rect final {
        int32_t left __attribute__ ((aligned(4)));
        int32_t top __attribute__ ((aligned(4)));
        int32_t right __attribute__ ((aligned(4)));
        int32_t bottom __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(IComposerClient::Rect, left) == 0, "wrong offset");
    static_assert(offsetof(IComposerClient::Rect, top) == 4, "wrong offset");
    static_assert(offsetof(IComposerClient::Rect, right) == 8, "wrong offset");
    static_assert(offsetof(IComposerClient::Rect, bottom) == 12, "wrong offset");
    static_assert(sizeof(IComposerClient::Rect) == 16, "wrong size");
    static_assert(__alignof(IComposerClient::Rect) == 4, "wrong alignment");

    struct FRect final {
        float left __attribute__ ((aligned(4)));
        float top __attribute__ ((aligned(4)));
        float right __attribute__ ((aligned(4)));
        float bottom __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(IComposerClient::FRect, left) == 0, "wrong offset");
    static_assert(offsetof(IComposerClient::FRect, top) == 4, "wrong offset");
    static_assert(offsetof(IComposerClient::FRect, right) == 8, "wrong offset");
    static_assert(offsetof(IComposerClient::FRect, bottom) == 12, "wrong offset");
    static_assert(sizeof(IComposerClient::FRect) == 16, "wrong size");
    static_assert(__alignof(IComposerClient::FRect) == 4, "wrong alignment");

    struct Color final {
        uint8_t r __attribute__ ((aligned(1)));
        uint8_t g __attribute__ ((aligned(1)));
        uint8_t b __attribute__ ((aligned(1)));
        uint8_t a __attribute__ ((aligned(1)));
    };

    static_assert(offsetof(IComposerClient::Color, r) == 0, "wrong offset");
    static_assert(offsetof(IComposerClient::Color, g) == 1, "wrong offset");
    static_assert(offsetof(IComposerClient::Color, b) == 2, "wrong offset");
    static_assert(offsetof(IComposerClient::Color, a) == 3, "wrong offset");
    static_assert(sizeof(IComposerClient::Color) == 4, "wrong size");
    static_assert(__alignof(IComposerClient::Color) == 1, "wrong alignment");

    enum class Command : int32_t {
        LENGTH_MASK = 65535, // 0xffff
        OPCODE_SHIFT = 16,
        OPCODE_MASK = -65536, // (0xffff << OPCODE_SHIFT)
        SELECT_DISPLAY = 0, // (0x000 << OPCODE_SHIFT)
        SELECT_LAYER = 65536, // (0x001 << OPCODE_SHIFT)
        SET_ERROR = 16777216, // (0x100 << OPCODE_SHIFT)
        SET_CHANGED_COMPOSITION_TYPES = 16842752, // (0x101 << OPCODE_SHIFT)
        SET_DISPLAY_REQUESTS = 16908288, // (0x102 << OPCODE_SHIFT)
        SET_PRESENT_FENCE = 16973824, // (0x103 << OPCODE_SHIFT)
        SET_RELEASE_FENCES = 17039360, // (0x104 << OPCODE_SHIFT)
        SET_COLOR_TRANSFORM = 33554432, // (0x200 << OPCODE_SHIFT)
        SET_CLIENT_TARGET = 33619968, // (0x201 << OPCODE_SHIFT)
        SET_OUTPUT_BUFFER = 33685504, // (0x202 << OPCODE_SHIFT)
        VALIDATE_DISPLAY = 33751040, // (0x203 << OPCODE_SHIFT)
